In [21]:
import numpy as np

In [22]:
a = np.array([0, 0.5, 1.0, 1.5])

In [23]:
type(a)

numpy.ndarray

In [24]:
a = np.arange(0,10)

In [25]:
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [26]:
a[5:]

array([5, 6, 7, 8, 9])

In [27]:
a[:2]

array([0, 1])

In [28]:
a.sum()

45

In [29]:
a.cumsum()

array([ 0,  1,  3,  6, 10, 15, 21, 28, 36, 45])

In [30]:
a.std()

2.8722813232690143

In [31]:
a*2

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [32]:
np.sqrt(a)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [33]:
b = np.int(3)

In [34]:
b

3

In [36]:
import math

In [37]:
a.size

10

In [38]:
a.ndim

1

In [39]:
a.shape

(10,)

In [40]:
a

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [41]:
a.reshape(5,2)

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7],
       [8, 9]])

In [42]:
a.reshape(5,2).T

array([[0, 2, 4, 6, 8],
       [1, 3, 5, 7, 9]])

In [43]:
a.flatten()

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [ ]:
h = np.array([0,10])

In [ ]:
h

In [ ]:
h = np.arange(0,10)

In [ ]:
h

In [ ]:
h.reshape(2,5)

In [ ]:
h > 5

In [ ]:
(h == 5).astype(int)

In [ ]:
h[h > 5]

In [ ]:
np.where(h % 2 == 0, 'even', 'odd')

In [ ]:
a = np.random.standard_normal((2,2
                              ))

In [ ]:
a

In [ ]:
a.sum()

In [ ]:
r = np.arange(12).reshape((4,3))

In [ ]:
s = np.arange(12).reshape((4,3)) * 0.5

In [ ]:
r

In [ ]:
s

In [ ]:
r + s

In [ ]:
r + 3

In [ ]:
r.T

In [ ]:
def f(x):
    return 3 * x + 5

In [ ]:
f(r)

In [45]:
import pandas as pd

In [46]:
df = pd.DataFrame([10,20,30,40],columns=['numbers'],index=['a','b','c','d'])

In [47]:
df

   numbers
a       10
b       20
c       30
d       40

In [48]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [49]:
df.columns

Index(['numbers'], dtype='object')

In [50]:
df.loc['c']

numbers    30
Name: c, dtype: int64

In [51]:
df.loc[['a','d']]

   numbers
a       10
d       40

In [52]:
df.sum()

numbers    100
dtype: int64

In [53]:
df.apply(lambda x: x ** 2)

   numbers
a      100
b      400
c      900
d     1600

In [54]:
df['names'] = ['Yves', 'Sandra','Lilli','Henry']

In [55]:
df

   numbers   names
a       10    Yves
b       20  Sandra
c       30   Lilli
d       40   Henry

In [56]:
df.iloc[0:-1]

   numbers   names
a       10    Yves
b       20  Sandra
c       30   Lilli

In [57]:
df

   numbers   names
a       10    Yves
b       20  Sandra
c       30   Lilli
d       40   Henry

In [58]:
df

   numbers   names
a       10    Yves
b       20  Sandra
c       30   Lilli
d       40   Henry

In [60]:
df['floats'] = (1.5, 2.5, 3.5, 4.5)

In [61]:
df

   numbers   names  floats
a       10    Yves     1.5
b       20  Sandra     2.5
c       30   Lilli     3.5
d       40   Henry     4.5

In [62]:
df.append({'numbers': 100, 'floats': 5.75, 'names': 'Jil'}, index=['y',])

   numbers   names  floats
0       10    Yves    1.50
1       20  Sandra    2.50
2       30   Lilli    3.50
3       40   Henry    4.50
4      100     Jil    5.75

In [63]:
df

   numbers   names  floats
a       10    Yves     1.5
b       20  Sandra     2.5
c       30   Lilli     3.5
d       40   Henry     4.5